RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/ИмпортЭкспорт/ИмпортЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИмпортЭкспорт</name>
  <enumValues>
    <name>Import</name>
  </enumValues>
  <enumValues>
    <name>Export</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ExportShipment/ExportShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ExportShipment</name>
  <basedOn>Document.ExportRequest</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedToCustoms</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleasedFromCustoms</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCDNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalFreightProvider</name>
    <type>
      <types>CatalogRef.FreightForwarders</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>POA</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>InternationalMOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>InternationalETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreAlertSent</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalETA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalATA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWBList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>170</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequestsNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportSpecialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MoveITCRNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoticeOfDeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OOC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalFreightSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomUnionTransaction</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSShipmentID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ExportRequests</name>
    <attributes>
      <name>ExportRequest</name>
      <type>
        <types>DocumentRef.ExportRequest</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OutOfComplianceReasons</name>
    <attributes>
      <name>OutOfComplianceReason</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/ManagerModule.bsl
Функция ПолучитьДоступныеItemsДляCustomsFileИCustomsBond(TypeOfTransaction, Shipment, ParentCompany, PermanentTemporary, PSAContract, CurrentCustomsFileLight) Экспорт
	
	// возвращает массив items, доступных для типов операции Customs file и Customs bond
	
	Если НЕ ЗначениеЗаполнено(TypeOfTransaction) Тогда
		ВызватьИсключение "Type of transaction is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Shipment) Тогда
		ВызватьИсключение "Shipment is empty!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("TypeOfTransaction", TypeOfTransaction);
	Запрос.УстановитьПараметр("Shipment", Shipment);
	Запрос.УстановитьПараметр("ParentCompany", ParentCompany);
	Запрос.УстановитьПараметр("PermanentTemporary", PermanentTemporary);
	Запрос.УстановитьПараметр("PSAContract", PSAContract);
	Запрос.УстановитьПараметр("CurrentCustomsFileLight", CurrentCustomsFileLight);
	
	ТипЗначенияShipment = ТипЗнч(Shipment);
	Если ТипЗначенияShipment = Тип("ДокументСсылка.Поставка") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Items.Ссылка
			|ИЗ
			|	Документ.Поставка.УпаковочныеЛисты КАК ImportShipmentDOCs
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонсолидированныйПакетЗаявокНаПеревозку.Инвойсы КАК DOCsInvoices
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтрокиИнвойса КАК Items
			|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.CustomsFilesLight.Items КАК CustomsFilesLightItems
			|				ПО Items.Ссылка = CustomsFilesLightItems.Item
			|					И (CustomsFilesLightItems.Ссылка.TypeOfTransaction = &TypeOfTransaction)
			|					И (CustomsFilesLightItems.Ссылка.Shipment = &Shipment)
			|					И (НЕ CustomsFilesLightItems.Ссылка.ПометкаУдаления)
			|					И (CustomsFilesLightItems.Ссылка <> &CurrentCustomsFileLight)
			|			ПО DOCsInvoices.Инвойс = Items.Инвойс
			|				И (НЕ Items.ПометкаУдаления)
			|		ПО ImportShipmentDOCs.УпаковочныйЛист = DOCsInvoices.Ссылка
			|ГДЕ
			|	ImportShipmentDOCs.Ссылка = &Shipment
			|	И ВЫБОР
			|			КОГДА &ParentCompany = ЗНАЧЕНИЕ(Справочник.SoldTo.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.SoldTo = &ParentCompany
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &PermanentTemporary = ЗНАЧЕНИЕ(Перечисление.PermanentTemporary.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.PermanentTemporary = &PermanentTemporary
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &PSAContract = ЗНАЧЕНИЕ(Справочник.PSAContracts.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.PSA = &PSAContract
			|		КОНЕЦ
			|	И CustomsFilesLightItems.Item ЕСТЬ NULL ";
		
	ИначеЕсли ТипЗначенияShipment = Тип("ДокументСсылка.ExportShipment") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Items.Ссылка
			|ИЗ
			|	Документ.ExportShipment.ExportRequests КАК ExportShipmentExportRequests
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтрокиИнвойса КАК Items
			|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.CustomsFilesLight.Items КАК CustomsFilesLightItems
			|			ПО Items.Ссылка = CustomsFilesLightItems.Item
			|				И (CustomsFilesLightItems.Ссылка.Shipment = &Shipment)
			|				И (CustomsFilesLightItems.Ссылка.TypeOfTransaction = &TypeOfTransaction)
			|				И (НЕ CustomsFilesLightItems.Ссылка.ПометкаУдаления)
			|				И (CustomsFilesLightItems.Ссылка <> &CurrentCustomsFileLight)
			|		ПО ExportShipmentExportRequests.ExportRequest = Items.ExportRequest
			|			И (НЕ Items.ПометкаУдаления)
			|ГДЕ
			|	ExportShipmentExportRequests.Ссылка = &Shipment
			|	И ВЫБОР
			|			КОГДА &ParentCompany = ЗНАЧЕНИЕ(Справочник.SoldTo.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.SoldTo = &ParentCompany
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &PermanentTemporary = ЗНАЧЕНИЕ(Перечисление.PermanentTemporary.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.PermanentTemporary = &PermanentTemporary
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &PSAContract = ЗНАЧЕНИЕ(Справочник.PSAContracts.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Items.PSA = &PSAContract
			|		КОНЕЦ
			|	И CustomsFilesLightItems.Item ЕСТЬ NULL ";
			
	Иначе
		ВызватьИсключение "Unknown shipment type '" + ТипЗначенияShipment + "'!";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				
КонецФункции

Функция ПолучитьРеквизитыItems(Items, ImportExport) Экспорт
	
	// для переданного массива Items, возвращает таблицу реквизитов, необходимую для работы документа Customs files light
	
	Если НЕ ЗначениеЗаполнено(ImportExport) Тогда
		ВызватьИсключение "Imp. / exp. is empty!";	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Items", Items);
	
	Если ImportExport = Перечисления.ИмпортЭкспорт.Import Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ParcelsItems.СтрокаИнвойса КАК Item,
			|	DOCsParcels.Ссылка.Номер КАК DOCNo,
			|	ParcelsItems.СтрокаИнвойса.Инвойс.Номер КАК ImportInvoiceNoExportRequestNo,
			|	ParcelsItems.СтрокаИнвойса.НомерСтрокиИнвойса КАК LineNo,
			|	ParcelsItems.СтрокаИнвойса.НомерЗаявкиНаЗакупку КАК PONo,
			|	ParcelsItems.СтрокаИнвойса.КодПоИнвойсу КАК PartNo,
			|	ParcelsItems.СтрокаИнвойса.СерийныйНомер КАК SerialNo,
			|	ВЫРАЗИТЬ(ParcelsItems.СтрокаИнвойса.НаименованиеТовара КАК СТРОКА(1024)) КАК Description,
			|	ParcelsItems.СтрокаИнвойса.Количество КАК Qty,
			|	ParcelsItems.СтрокаИнвойса.ЕдиницаИзмерения.Код КАК QtyUOMCode,
			|	СУММА(ParcelsItems.NetWeight) КАК ParcelsNetWeight,
			|	ParcelsItems.Ссылка.WeightUOM.Код КАК WeightUOMCode,
			|	ParcelsItems.СтрокаИнвойса.СтранаПроисхождения КАК CountryOfOrigin,
			|	ParcelsItems.СтрокаИнвойса.МеждународныйКодТНВЭД КАК InvoiceHTC,
			|	ParcelsItems.СтрокаИнвойса.Цена КАК Price,
			|	ParcelsItems.СтрокаИнвойса.Currency КАК Currency,
			|	ParcelsItems.СтрокаИнвойса.Currency.НаименованиеEng КАК CurrencyNameEng,
			|	ParcelsItems.СтрокаИнвойса.Сумма КАК TotalPrice,
			|	ParcelsItems.СтрокаИнвойса.SoldTo КАК ParentCompany,
			|	ParcelsItems.СтрокаИнвойса.PermanentTemporary КАК PermanentTemporary,
			|	ParcelsItems.СтрокаИнвойса.PSA КАК PSAContract,
			|	ParcelsItems.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку КАК POLine,
			|	ParcelsItems.СтрокаИнвойса.КостЦентр КАК AU
			|ИЗ
			|	Справочник.Parcels.Детали КАК ParcelsItems
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонсолидированныйПакетЗаявокНаПеревозку.Parcels КАК DOCsParcels
			|		ПО ParcelsItems.Ссылка = DOCsParcels.Parcel
			|			И (НЕ DOCsParcels.Ссылка.Отменен)
			|ГДЕ
			|	ParcelsItems.СтрокаИнвойса В(&Items)
			|
			|СГРУППИРОВАТЬ ПО
			|	DOCsParcels.Ссылка.Номер,
			|	ParcelsItems.СтрокаИнвойса,
			|	ParcelsItems.СтрокаИнвойса.Инвойс.Номер,
			|	ParcelsItems.СтрокаИнвойса.НомерСтрокиИнвойса,
			|	ParcelsItems.СтрокаИнвойса.НомерЗаявкиНаЗакупку,
			|	ParcelsItems.СтрокаИнвойса.КодПоИнвойсу,
			|	ParcelsItems.СтрокаИнвойса.СерийныйНомер,
			|	ВЫРАЗИТЬ(ParcelsItems.СтрокаИнвойса.НаименованиеТовара КАК СТРОКА(1024)),
			|	ParcelsItems.СтрокаИнвойса.Количество,
			|	ParcelsItems.СтрокаИнвойса.ЕдиницаИзмерения.Код,
			|	ParcelsItems.Ссылка.WeightUOM.Код,
			|	ParcelsItems.СтрокаИнвойса.СтранаПроисхождения,
			|	ParcelsItems.СтрокаИнвойса.МеждународныйКодТНВЭД,
			|	ParcelsItems.СтрокаИнвойса.Цена,
			|	ParcelsItems.СтрокаИнвойса.Currency,
			|	ParcelsItems.СтрокаИнвойса.Currency.НаименованиеEng,
			|	ParcelsItems.СтрокаИнвойса.Сумма,
			|	ParcelsItems.СтрокаИнвойса.SoldTo,
			|	ParcelsItems.СтрокаИнвойса.PermanentTemporary,
			|	ParcelsItems.СтрокаИнвойса.PSA,
			|	ParcelsItems.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку,
			|	ParcelsItems.СтрокаИнвойса.КостЦентр
			|
			|УПОРЯДОЧИТЬ ПО
			|	DOCNo,
			|	ImportInvoiceNoExportRequestNo,
			|	LineNo";
		
	ИначеЕсли ImportExport = Перечисления.ИмпортЭкспорт.Export Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ParcelsItems.СтрокаИнвойса КАК Item,
			|	ParcelsItems.Ссылка.ExportRequest.Номер КАК ImportInvoiceNoExportRequestNo,
			|	ParcelsItems.СтрокаИнвойса.НомерСтрокиИнвойса КАК LineNo,
			|	ParcelsItems.СтрокаИнвойса.НомерЗаявкиНаЗакупку КАК PONo,
			|	ParcelsItems.СтрокаИнвойса.КодПоИнвойсу КАК PartNo,
			|	ParcelsItems.СтрокаИнвойса.СерийныйНомер КАК SerialNo,
			|	ВЫРАЗИТЬ(ParcelsItems.СтрокаИнвойса.НаименованиеТовара КАК СТРОКА(1024)) КАК Description,
			|	ParcelsItems.СтрокаИнвойса.Количество КАК Qty,
			|	ParcelsItems.СтрокаИнвойса.ЕдиницаИзмерения.Код КАК QtyUOMCode,
			|	СУММА(ParcelsItems.NetWeight) КАК ParcelsNetWeight,
			|	ParcelsItems.Ссылка.WeightUOM.Код КАК WeightUOMCode,
			|	ParcelsItems.СтрокаИнвойса.СтранаПроисхождения КАК CountryOfOrigin,
			|	ParcelsItems.СтрокаИнвойса.МеждународныйКодТНВЭД КАК InvoiceHTC,
			|	ParcelsItems.СтрокаИнвойса.Цена КАК Price,
			|	ParcelsItems.СтрокаИнвойса.Currency КАК Currency,
			|	ParcelsItems.СтрокаИнвойса.Currency.НаименованиеEng КАК CurrencyNameEng,
			|	ParcelsItems.СтрокаИнвойса.Сумма КАК TotalPrice,
			|	ParcelsItems.СтрокаИнвойса.SoldTo КАК ParentCompany,
			|	ParcelsItems.СтрокаИнвойса.PermanentTemporary КАК PermanentTemporary,
			|	ParcelsItems.СтрокаИнвойса.PSA КАК PSAContract,
			|	ParcelsItems.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку КАК POLine,
			|	ParcelsItems.СтрокаИнвойса.КостЦентр КАК AU
			|ИЗ
			|	Справочник.Parcels.Детали КАК ParcelsItems
			|ГДЕ
			|	ParcelsItems.СтрокаИнвойса В(&Items)
			|	И НЕ ParcelsItems.Ссылка.Отменен
			|
			|СГРУППИРОВАТЬ ПО
			|	ParcelsItems.СтрокаИнвойса,
			|	ParcelsItems.Ссылка.ExportRequest.Номер,
			|	ParcelsItems.СтрокаИнвойса.НомерСтрокиИнвойса,
			|	ParcelsItems.СтрокаИнвойса.КодПоИнвойсу,
			|	ParcelsItems.СтрокаИнвойса.СерийныйНомер,
			|	ParcelsItems.СтрокаИнвойса.Количество,
			|	ParcelsItems.СтрокаИнвойса.ЕдиницаИзмерения.Код,
			|	ParcelsItems.Ссылка.WeightUOM.Код,
			|	ParcelsItems.СтрокаИнвойса.СтранаПроисхождения,
			|	ParcelsItems.СтрокаИнвойса.МеждународныйКодТНВЭД,
			|	ParcelsItems.СтрокаИнвойса.Цена,
			|	ParcelsItems.СтрокаИнвойса.Currency,
			|	ParcelsItems.СтрокаИнвойса.Currency.НаименованиеEng,
			|	ParcelsItems.СтрокаИнвойса.Сумма,
			|	ВЫРАЗИТЬ(ParcelsItems.СтрокаИнвойса.НаименованиеТовара КАК СТРОКА(1024)),
			|	ParcelsItems.СтрокаИнвойса.SoldTo,
			|	ParcelsItems.СтрокаИнвойса.PermanentTemporary,
			|	ParcelsItems.СтрокаИнвойса.PSA,
			|	ParcelsItems.СтрокаИнвойса.НомерЗаявкиНаЗакупку,
			|	ParcelsItems.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку,
			|	ParcelsItems.СтрокаИнвойса.КостЦентр
			|
			|УПОРЯДОЧИТЬ ПО
			|	ImportInvoiceNoExportRequestNo,
			|	LineNo";
		
	КонецЕсли;
	
	ТаблицаItems = Запрос.Выполнить().Выгрузить();
	ТаблицаItems.Индексы.Добавить("Item");
	Возврат ТаблицаItems;
	
КонецФункции

Функция ПолучитьCustomsDepositSum(CustomsFile, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("CustomsFilesLight", CustomsFile);
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(CustomsDepositsОбороты.SumОборот, 0)) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.CustomsDeposits.Обороты(, , Регистратор, Cu = &CustomsFilesLight) КАК CustomsDepositsОбороты
	               |ГДЕ
	               |	CustomsDepositsОбороты.Регистратор <> &Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции
